//Вам необходимо создать программу с собственным классом Пациент.
//В классе вам нужно описать переменные характерные для данной сущности, например у пациента могут быть
// переменные ФИО, возраст, диагноз и тд.
//В классе должны быть обязательно переменные типов int, String, boolean.
//Далее в главном классе вы должны создать минимум 3 объекта Пациента и заполнить их данными из консоли
// (ввод данных сделать в отдельном методе).
//После ввода данных вы должны вывести данные на экран в следующем виде:
//Пациент “ФИО” - Возраст = “возраст”
//Далее вы должны дать пользователю возможность найти пациента по фамилии и по возрасту.
//Это значит, что в консоли должно появится предложение найти пользователя по ФИО или по возрасту.
//Пользователь вводит нужное имя, и программа отображает всех пациентов с данным именем (тоже самое сделать для возраста).
// Опять же поиск происходит в отдельных методах.
public class Task3_2 {
    public static void main(String[] args) {

    }
}
